danieleff/STM32GENERIC/STM32/boards.txt
#################################### Nucleo-144 ############################################
# NUCLEO 144 board

NUCLEO_144.name=Nucleo-144
NUCLEO_144.vid.0=0x0483
NUCLEO_144.pid.0=0x374B

NUCLEO_144.build.core=arduino
NUCLEO_144.build.board=NUCLEO_144
NUCLEO_144.upload.tool=nucleoFlasher

NUCLEO_144.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3


NUCLEO_144.menu.subboard.Nucleo_F767ZI=Nucleo-F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.upload.maximum_size=2097152
NUCLEO_144.menu.subboard.Nucleo_F767ZI.upload.maximum_data_size=524288
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -DHSE_VALUE=((uint32_t)8000000)
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.series=STM32F7
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.variant=NUCLEO_F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.extra_flags=-DSTM32F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.massstorage_drive=EVAL-FUCKST
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.f_cpu=216000000L


NUCLEO_144.menu.upload_method.MassStorageMethod=Mass Storage
NUCLEO_144.menu.upload_method.MassStorageMethod.upload.protocol=
NUCLEO_144.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

NUCLEO_144.menu.upload_method.STLinkMethod=STLink
NUCLEO_144.menu.upload_method.STLinkMethod.upload.protocol=STLink
NUCLEO_144.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

################################################################################
# Discovery L053C8 board

DISCOVERY_L053C8.name=Discovery L053C8

DISCOVERY_L053C8.upload.maximum_size=65536
DISCOVERY_L053C8.upload.maximum_data_size=8192

DISCOVERY_L053C8.build.core=arduino
DISCOVERY_L053C8.build.board=DISCOVERY_L053C8

DISCOVERY_L053C8.build.mcu=cortex-m0
DISCOVERY_L053C8.build.series=STM32L0
DISCOVERY_L053C8.build.variant=DISCOVERY_L053C8
DISCOVERY_L053C8.build.extra_flags=-DSTM32L053C8
DISCOVERY_L053C8.build.f_cpu=32000000L

DISCOVERY_L053C8.upload.protocol=STLink
DISCOVERY_L053C8.upload.tool=stlink_upload

DISCOVERY_L053C8.menu.upload_method.STLinkMethod=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_L053C8.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

DISCOVERY_L053C8.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
DISCOVERY_L053C8.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_L053C8.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_L053C8.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_L053C8.menu.usb.Disabled=Disabled, no USB

DISCOVERY_L053C8.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/PA10]
DISCOVERY_L053C8.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_L053C8.menu.serial.SerialUSB=SerialUSB (USB connector)
DISCOVERY_L053C8.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

###################################### F103Z ##########################################
F103Z.name=F103Z
F103Z.build.mcu=cortex-m3
F103Z.build.board=F103Z
F103Z.build.core=arduino
F103Z.build.series=STM32F1
F103Z.build.f_cpu=72000000L

F103Z.menu.subboard.F103ZE1=RedBull(F103ZE)
F103Z.menu.subboard.F103ZE1.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE1.upload.maximum_data_size=65536
F103Z.menu.subboard.F103ZE1.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE1.build.variant=F103Z
F103Z.menu.subboard.F103ZE1.build.board=REDBULL
F103Z.menu.subboard.F103ZE1.build.extra_flags=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE1.build.ldscript=f103xE.ld
F103Z.menu.subboard.F103ZE1.massstorage_drive=NUCLEO

F103Z.menu.subboard.F103ZE=GENERIC(STM32F103ZE)
F103Z.menu.subboard.F103ZE.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE.upload.maximum_data_size=65536
F103Z.menu.subboard.F103ZE.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE.build.variant=F103Z
F103Z.menu.subboard.F103ZE.build.board=GENERIC_F103Z
F103Z.menu.subboard.F103ZE.build.extra_flags=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE.build.ldscript=f103xE.ld
F103Z.menu.subboard.F103ZE.massstorage_drive=NUCLEO

F103Z.menu.subboard.F103ZF=GENERIC(STM32F103ZF)
F103Z.menu.subboard.F103ZF.upload.maximum_size=786432
F103Z.menu.subboard.F103ZF.upload.maximum_data_size=98304
F103Z.menu.subboard.F103ZF.upload.device=STM32F103ZF
F103Z.menu.subboard.F103ZF.build.extra_flags=-DSTM32F103ZF
F103Z.menu.subboard.F103ZF.build.variant=F103Z
F103Z.menu.subboard.F103ZF.build.board=GENERIC_F103Z
F103Z.menu.subboard.F103ZF.build.ldscript=f103xF.ld
F103Z.menu.subboard.F103ZF.massstorage_drive=NUCLEO

F103Z.menu.subboard.F103ZG=GENERIC(STM32F103ZG)
F103Z.menu.subboard.F103ZG.upload.maximum_size=1048576
F103Z.menu.subboard.F103ZG.upload.maximum_data_size=98304
F103Z.menu.subboard.F103ZG.upload.device=STM32F103ZG
F103Z.menu.subboard.F103ZG.build.extra_flags=-DSTM32F103ZG
F103Z.menu.subboard.F103ZG.build.series=STM32F1
F103Z.menu.subboard.F103ZG.build.variant=F103Z
F103Z.menu.subboard.F103ZG.build.board=GENERIC_F103Z
F103Z.menu.subboard.F103ZG.build.ldscript=f103xG.ld
F103Z.menu.subboard.F103ZG.massstorage_drive=NUCLEO


#---------------------------- UPLOAD METHODS ---------------------------

F103Z.menu.upload_method.STLinkMethod=STLink
F103Z.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103Z.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103Z.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.upload_method.jLinkMethod=JLink
F103Z.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103Z.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103Z.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103Z.menu.upload_method.MassStorageMethod.upload.protocol=
F103Z.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103Z.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103Z.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103Z.menu.upload_method.BMPMethod.upload.tool=bmp_upload
F103Z.menu.upload_method.BMPMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1, BOOT1=0]
F103Z.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103Z.menu.upload_method.serialMethod.upload.tool=serial_upload
F103Z.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1


